tutorials/compressible/rhoSimpleFoam/aerofoilNACA0012/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.2 -0.1 -0.2) (1.2 0.1 0.2);
    }

    {
        name    z1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     c1;     // cellSet
    }
);


// ************************************************************************* //
